; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   blue_block_1 purple_block_1 orange_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (or (not (and (ontable blue_block_1) (not (= ?obj blue_block_1)))) (on orange_block_1 purple_block_1)) (hold_0)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (or (not (or (= ?obj blue_block_1) (ontable blue_block_1))) (on orange_block_1 purple_block_1)) (hold_0)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (or (not (ontable blue_block_1)) (and (= ?obj orange_block_1) (= ?underobj purple_block_1)) (on orange_block_1 purple_block_1)) (hold_0)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (or (not (ontable blue_block_1)) (and (on orange_block_1 purple_block_1) (not (and (= ?obj orange_block_1) (= ?underobj purple_block_1))))) (hold_0)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
   green_block_1 purple_block_2 - block
 )
 (:init (ontable green_block_1) (ontable blue_block_1) (on purple_block_1 green_block_1) (ontable orange_block_1) (on purple_block_2 blue_block_1) (clear purple_block_1) (clear orange_block_1) (clear purple_block_2) (handempty) (= (total-cost) 0))
 (:goal (and (ontable purple_block_1) (hold_0)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack purple_block_1 green_block_1)
   deleted: (on purple_block_1 green_block_1) (clear purple_block_1) (handempty)
   added: (holding purple_block_1) (clear green_block_1)
   goals met: 0 of 2
2. (putdown purple_block_1)
   deleted: (holding purple_block_1)
   added: (clear purple_block_1) (handempty) (ontable purple_block_1)
   goals met: 1 of 2
3. (pickup orange_block_1)
   deleted: (clear orange_block_1) (ontable orange_block_1) (handempty)
   added: (holding orange_block_1)
   goals met: 1 of 2
4. (stack orange_block_1 purple_block_1)
   deleted: (clear purple_block_1) (holding orange_block_1)
   added: (handempty) (clear orange_block_1) (on orange_block_1 purple_block_1) (hold_0)
   goals met: 2 of 2
